window.ParsleyConfig = window.ParsleyConfig || {};

(function ($) {
  window.ParsleyConfig = $.extend( true, {}, window.ParsleyConfig, {
    messages: {
      // parsley //////////////////////////////////////
        defaultMessage: "Тази стойност е грешна."
        , type: {
            email:      "Тази стойност трябва да е валиден имейл."
          , url:        "Тази стойност трябва да е валиден url."
          , urlstrict:  "Тази стойност трябва да е валиден url."
          , number:     "Тази стойност трябва да е номер."
          , digits:     "Тази стойност трябва да е цифра."
          , dateIso:    "Тази стойност трябва да е валидна дата (YYYY-MM-DD)."
          , alphanum:   "Тази стойност трябва да е буквено-цифрова."
          , phone:      "Тази стойност трябва да е валиден телефонен номер."
        }
      , notnull:        "Тази стойност не трябва да е null."
      , notblank:       "Тази стойност не трябва да е празна."
      , required:       "Тази стойност е задължителна."
      , regexp:         "Тази стойност е невалидна."
      , min:            "Тази стойност трябва да е по-голяма или равна на %s."
      , max:            "Тази стойност трябва да е по-малка или равна на %s."
      , range:          "Тази стойност трябва да е между %s и %s."
      , minlength:      "Тази стойност е прекалено малка. Тя трябва да съдържа %s символа или повече."
      , maxlength:      "Тази стойност е прекалено голяма. Тя трябва да е %s символа или по-малко."
      , rangelength:    "Дължината на тазистойност е невалидна. Тя трябва да е между %s и %s символа."
      , mincheck:       "Вие трябва да изберете поне %s опция(и)."
      , maxcheck:       "Вие трябва да изберете %s опция(и) или по-малко."
      , rangecheck:     "Вие трябва да изберете между %s и %s опции."
      , equalto:        "Тази стойност трябва да е същата."

      // parsley.extend ///////////////////////////////
      , minwords:       "Тази стойност трябва да съдържа най-малко %s думи."
      , maxwords:       "Тази стойност може да съдържа най-много %s думи."
      , rangewords:     "Тази стойност трябва да съдържа между %s и %s думи."
      , greaterthan:    "Тази стойност трябва да е по-голяма от %s."
      , lessthan:       "Тази стойност трябва да е по-малка от %s."
      , beforedate:     "Тази дата трябва да е преди %s."
      , afterdate:      "Тази дата трябва да е след %s."
      , americandate:  "Тази стойност трябва да е валидна дата (MM/DD/YYYY)."
    }
  });
}(window.jQuery || window.Zepto));
